LEXICON_RU = {
    "/start": "👋 Привет! Выбери действие на клавиатуре.",
    "/review": "Как вы оцениваете работу бота?",
    "review_positive": "Спасибо за ваш положительный отзыв! 😊",
    "review_negative": "Сожалеем, что вам не понравилось. Мы будем работать над улучшением! 😔",
    "go_back": "Возврат в главное меню.",
    "route_menu": "Введите адрес отправления и прибытия через стрелку ->.\n"
                  "Например: Москва, Ленина 10 -> Пушкина 5, Москва",
    "/help": "🤖 Бот для работы с картами и маршрутами\n\n"
             "Возможности:\n"
             "- Построение маршрутов\n"
             "- Определение геолокации\n"
             "- Быстрый доступ к функциям через кнопки",
    "request_location": "Пожалуйста, отправьте ваше местоположение.",
    "handle_location": "Ваше местоположение:\n"
                       "Широта: {latitude}\n"
                       "Долгота: {longitude}",
    "handle_location_error": "Не удалось определить местоположение.",
    "invalid_format": "Неверный формат ввода. Пожалуйста, используйте формат 'Адрес 1 -> Адрес 2'.",
    "address_not_found": "Не удалось найти один из адресов. Проверьте правильность написания.",
    "gpx_caption": "Вот ваш GPX файл маршрута.",
    "route_info": "Начальный адрес: {origin}\n"
                  "Координаты: {origin_coords_0}, {origin_coords_1}\n\n"
                  "Конечный адрес: {destination}\n"
                  "Координаты: {destination_coords_0}, {destination_coords_1}\n\n"
                  "Ссылка на маршрут: {route_url_1}\n",
    "error": "Произошла ошибка: {e}"
}